import os, random

poetry = [["楚江怀古三首·其一", "露气寒光集，微阳下楚丘。",
           "猿啼洞庭树，人在木兰舟。", "广泽生明月，苍山夹乱流。",
           "云中君不见，竟夕自悲秋。"],
          ["逢入京使",
           "故园东望路漫漫，双袖龙钟泪不干。",
           "马上相逢无纸笔，凭君传语报平安。"],
          ["贺新郎·甚矣吾衰矣",
           "邑中园亭，仆皆为赋此词。一日，独坐停云，水声山色，竞来相娱。意溪山欲援例者，遂作数语，庶几仿佛渊明思亲友之意云。",
           "甚矣吾衰矣。怅平生、交游零落，只今余几！白发空垂三千丈，一笑人间万事。问何物、能令公喜？我见青山多妩媚，料青山见我应如是。情与貌，略相似。",
           "一尊搔首东窗里。想渊明、《停云》诗就，此时风味。江左沉酣求名者，岂识浊醪妙理。回首叫、云飞风起。不恨古人吾不见，恨古人不见吾狂耳。知我者，二三子。"]]

name = "李、王、张、刘、陈、杨、赵、黄、周、吴、徐、孙、胡、朱、高、林、何、郭、马、罗、梁、宋、郑、谢、韩、唐、冯、于、董、萧、程、曹、袁、邓、许、傅、沈、曾、彭、吕、苏、卢、蒋、蔡、贾、丁、魏、薛、叶、阎、余、潘、杜、戴、夏、钟、汪、田、任、姜、范、方、石、姚、谭、廖、邹、熊、金、陆、郝、孔、白、崔、康、毛、邱、秦、江、史、顾、侯、邵、孟、龙、万、段、漕、钱、汤、尹、黎、易、常、武、乔、贺、赖、龚、文、庞、樊、兰、殷、施、陶、翟、安、颜、倪、严、牛、温、芦、季、俞、章、鲁、葛、伍、韦、申、尤、毕、聂、从、焦、向、柳、邢、路、岳、齐、沿、梅、莫、庄、辛、管、祝、左、涂、谷、祁、时、舒、耿、牟、卜、路、詹、关、苗、凌、费、纪、靳、盛、童、欧、甄、项、曲、成、游、阳、裴、席、卫、查、屈、鲍、位、覃、霍、翁、隋、植、甘、景、薄、单、包、司、柏、宁、柯、阮、桂、闵、欧阳、解、强、柴、华、车、冉、房、边、辜、吉、饶、刁、瞿、戚、丘、古、米、池、滕、晋、苑、邬、臧、畅、宫、来、嵺、苟、全、褚、廉、简、娄、盖、符、奚、木、穆、党、燕、郎、邸、冀、谈、姬、屠、连、郜、晏、栾、郁、商、蒙、计、喻、揭、窦、迟、宇、敖、糜、鄢、冷、卓、花、仇、艾、蓝、都、巩、稽、井、练、仲、乐、虞、卞、封、竺、冼、原、官、衣、楚、佟、栗、匡、宗、应、台、巫、鞠、僧、桑、荆、谌、银、扬、明、沙、薄、伏、岑、习、胥、保、和、蔺"

name_list = name.split("、")

index = int(input("输入一个整数:"))


def mkdir(path, temp):
    folder = os.path.exists(path)
    print(path + "/" + temp + ".txt")
    if not folder:  # 判断是否存在文件夹如果不存在则创建为文件夹
        os.makedirs(path)  # makedirs 创建文件时如果路径不存在会创建这个路径
        f = open(path + "/" + temp + ".txt", mode='a', encoding="utf-8")
        f.writelines(str(random.randint(0, 100)))
        for i in poetry[index]:
            f.writelines("\n" + i)
            # f.writelines(i)
        f.close()
        os.remove(path + "/" + temp + ".txt")
        print("删除文件")
        os.rmdir(path)
        print("删除文件夹")


for temp in name_list:
    file = "./百家姓" + "/" + temp
    mkdir(file, temp)  # 调用函数

# file = "./百家姓111" + "/" + name_list[0]
# mkdir(file, name_list[0])
